# Install languages & dependency managers
brew 'node'
brew 'yarn'
brew 'nvm'
brew 'go'
brew 'glide'
brew 'ruby'
brew 'rbenv'

# Install Cloud SDKs
brew 'awscli'
brew 'heroku'
brew 'kubernetes-cli'
cask 'google-cloud-sdk'

# Install file sync tool
brew 'rclone'

# Install useful utilities
brew 'direnv'
brew 'httpie'
brew 'tree'
brew 'tig'
brew 'zsh'

# Install databases
brew 'redis', restart_service: :changed
brew 'postgresql', restart_service: :changed

# Install Applications
cask 	'1Password'
cask 	'alfred'
cask 	'appcleaner'
cask 	'calibre'
cask 	'dash'
mas 	'Day One', id: 1055511498
cask 	'docker'
cask 	'fantastical'
cask 	'firefox'
cask 	'google-chrome'
cask 	'iterm2'
cask 	'little-snitch'
mas 	'Magnet', id: 441258766
cask 	'micro-snitch'
cask 	'parallels-desktop'
cask 	'paw'
mas 	'Pocket', id: 568494494
cask 	'postico'
cask 	'rescuetime'
cask 	'rowanj-gitx'
cask	'screenhero'
cask 	'slack'
cask 	'spotify'
cask 	'sublime-text'
cask 	'timely'
cask 	'transmission'
cask 	'vlc'
mas 	'XCode', id: 497799835
